"""
线性回归介绍：
    概述：来描述多个自变量（特征）与因边量（标签）之间的关系，对关系进行建模，之后基于特征预测标签
        线性回归属于监督学习：有特征，有标签，且标签是连续的
    分类：
        一元线性回归和多元线性回归
    公式：
        总结为y=wx+b，其中，w称为权重，数学中也叫斜率，b称为偏置，数学中也叫截距
        当w为一维时，就是一元线性回归，本质就是一个一元一次函数
        当w和x为多维时，就是多元线性回归，

    误差：预测值 - 真实值
    损失函数（Loss function，也叫成本函数、代价函数、目标函数，cost function）：描述样本点和其预测值之间的关系，损失函数越小，就是误差越小，评估准确率就越高
    损失函数分类：
        1、均方误差（MSE）：J(w,b)=每个样本点误差的平方和的平均值（平方求和再求平均）
        2、均方根误差（RMSE）：对MSE开平方
        3、平均绝对误差（MAE）：每个样本点的误差绝对值之和（绝对值求和）
        RMSE和MSE含义平方项，对于较大的异常点有着更重的惩罚，对异常点更加敏感
    让损失函数变小的方法：
        1、正规方程：
            描述：假设矩阵X（m*n）为特征举证，对应m个样本点的n个特征，取增广举证X’（就是在X右边加一列单位向量，对应kx+b中的b的系数，这里将b也看成回归参数）
                假设W为回归参数，则有Y'=XW，Y'为预测结果组成的向量，根据最小二乘法计算损失函数J(W)=Σ(XW-Y)²，根据L2范数计算规则，将J(W)转换成
                ||XW-Y||的L2范数的平方，接着根据损失函数最小的原则，计算梯度，另结果为0，即可得到回归参数
            最终结果：W=(XᵀX)⁻¹Xᵀy
            弊端：
                1、计算成本高
                2、矩阵可能不可逆
                3、
        2、梯度下降
            描述：梯度下降法是一种通过不断调整模型参数，使损失函数逐渐减小，最终逼近最优参数的迭代优化算法。
                梯度是矢量，函数在某点的梯度方向是函数在这点增长最快的方向
            通用计算公式：
                W'=W-α*梯度   α为学习率，又叫步长，不能过大也不能过小
            分类：
                1、全梯度下降
                2、随机梯度下降
                3、小批量梯度下降
                4、随机平均梯度下降
"""
# 导包
from sklearn.linear_model import LinearRegression

#1、准备数据
x_train=[[81],[83],[85],[89],[92],[94]]
y_train=[5.67,5.79,6.02,6.32,6.83,7.01]
x_test=[[188]]

#2、数据预处理（划分数据集），这里不需要

#3、特征工程（特征提取，特征预处理）

#4、模型训练
estimator=LinearRegression()
estimator.fit(x_train,y_train)

#查看权重和偏置
print(f'权重是：{estimator.coef_}')
print(f'偏置是：{estimator.intercept_}')

#5、模型预测
y_pre=estimator.predict(x_test)
print(f'预测结果为{y_pre}')